app/controllers/categories_controller.rb

DELETE FROM `categories` WHERE `categories`.`id` = 2
---
  def destroy
    @category.destroy

INSERT INTO `categories` (`name`, `slug`) VALUES ('Catégorie de test', 'categorie-de-test')
---
  def create
    @category = Category.create(category_params)