app/controllers/posts_controller.rb

  def index
    # cookies.permanent.signed[:username] = "Louis"
    # cookies.delete(:username)
    @posts = Post.all
---
SELECT `posts`.* FROM `posts`

  def update
    if @post.update(post_params)
---
UPDATE `posts` SET `content` = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Amet aspernatur atque consequuntur corporis cum cupiditate eveniet excepturi fugit itaque necessitatibus!', `updated_at` = '2020-01-18 22:29:12' WHERE `posts`.`id` = 3

  def create
    post = Post.new(post_params)
    if post.valid?
      post.save
---
INSERT INTO `posts` (`name`, `content`, `created_at`, `updated_at`, `slug`) VALUES ('Azerty123', 'Bonjour à tous !', '2020-01-23 23:34:47', '2020-01-23 23:34:47', 'azerty123')